# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  # image1
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2fCIB, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

  # image2
  - [ -1, 1, Conv, [ 64, 3, 2 ] ] # 10
  - [ -1, 1, Conv, [ 128, 3, 2 ] ] # 11
  - [ -1, 3, C2f, [ 128, True ] ]
  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 13
  - [ -1, 6, C2f, [ 256, True ] ]
  - [ -1, 1, SCDown, [ 512, 3, 2 ] ] # 15
  - [ -1, 6, C2f, [ 512, True ] ]
  - [ -1, 1, SCDown, [ 1024, 3, 2 ] ] # 17
  - [ -1, 3, C2fCIB, [ 1024, True ] ]
  - [ -1, 1, SPPF, [ 1024, 5 ] ] # 19

  # fuse
  - [ [ 4, 14 ], 1, Concat, [ 1 ] ] # 20
  - [ -1, 1, Conv, [ 256, 1, 1 ] ] # 21
  - [ [ 6, 16 ], 1, Concat, [ 1 ] ] # 22
  - [ -1, 1, Conv, [ 512, 1, 1 ] ] # 23
  - [ [ 9, 19 ], 1, Concat, [ 1 ] ] # 24
  - [ -1, 1, Conv, [ 1024, 1, 1 ] ] # 25

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 23], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 28

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 21], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 31 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 28], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2fCIB, [512, True]] # 34 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 25], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True]] # 37 (P5/32-large)

  - [[31, 34, 37], 1, v10Detect, [nc]] # Detect(P3, P4, P5) 40
